---
layout: page
title:  "SSH"
date:   2022-08-24 14:30:30 +0900
categories: Networks
tags: SSH
permalink: /Networks/SSH/
---

## What's SSH? 

SSH, Secure Socket Shell was developed to make up for vulnarability of Telnet services. \
With encryption key, SSH provides secured remote connection between network devices.  
<br/>

## How to set SSH on Cisco device?
</br>

1. Enters Configuration mode
```
Switch#configure terminal 
```
</br>

2. Configuring user and password 
```
Switch(config)# username admin password 123 
```
</br>

3. Set the previleage mode password

```
Switch(config)#enable secret 123 
```
</br>

4. Setting hostname of your device (important!)
```
Switch(config)#hostname <your hostname> 
```
</br>

5. Set your own domain name 
```
Switch(config)#ip domain-name <your domain name> 
```
</br>

6. Make encryption key for secure connection (in this example, I used RSA)
```
Switch(config)#crypto key generate rsa 
```
</br>

7. Then this texts will show up </br>
   You need to configure bitrate for RSA key 
```
The name for the keys will be: Switch.<your domain name>
Choose the size of the key modulus in the range of 360 to 4096 for your
General Purpose Keys. Choosing a key modulus greater than 512 may take
a few minutes.

How many bits in the modules [512]: 1024 

% Generating 1024 bit RSA keys, keys will be non-exportable...
[OK] (elapsed time was 4 seconds)
```
</br>

8. In this line, you can configure previleage level to each users. 0 and 15 means administrator 
```
Switch(config)#line vty 0 15 
```

Switch(config-line)#transport input ssh 
## allows input only SSH 


Switch(config-line)#login local
## means you're gonna log in with this local account only
```

## Additional configuration

### Setting SSH version

```
Switch(config)#ip ssh version 1 ## SSH v1

Switch(config)#ip ssh version 2 ## uses SSH v2 (official Cisco recommended)

Switch(config)#no ip ssh version ## uses both v1 and v2

